## Basic Syntax

### Basic Types

In [ ]:
print(type("a"))
print(type(2))
print(type(2.5))

<class 'str'>
<class 'int'>
<class 'float'>
<class 'str'>

### Types of fill in blank print statements

In [52]:
# Basic Version
print("This " + "is " + "pretty " + "neat!")

This is pretty neat!

In [53]:
# Another Basic way
phraze = f"Bleh\n"+ '_'*20
print(phraze)

Bleh
____________________

In [54]:
# .format Version
print('{} {} {} {}.'.format("This", 'is', 'pretty', 'neat'))

This is pretty neat.

In [55]:
# f-string: My preferred method (f-string: formatted string literals)
base = 6
height = 3
area = (base*height)/2
print(f"The area of the triangle is: {str(area)}")

The area of the triangle is: 9.0

In [58]:
import typing
# Define a variable of type str
z: str = "Hello, world!"
# Define a variable of type int
x: int = 10
# Define a variable of type float
y: float = 1.23
# Define a variable of type list
list_of_numbers: typing.List[int] = [1, 2, 3]
# Define a variable of type tuple
tuple_of_numbers: typing.Tuple[int, int, int] = (1, 2, 3)
# Define a variable of type dict
dictionary: typing.Dict[str, int] = {"key1": 1, "key2": 2}
# Define a variable of type set
set_of_numbers: typing.Set[int] = {1, 2, 3, 3}

In [63]:
set_of_number2 = list(set_of_numbers)
set_of_number2.append(3)
set_of_number2
set_of_numbers = set(set_of_number2)
set_of_numbers

{1, 2, 3}

In [59]:
# print(z)
# print((type(z)))
# x
# y
# list_of_numbers
# tuple_of_numbers
# dictionary
set_of_numbers

{1, 2, 3}

### Joins

In [65]:
string1 = "Greetings, Earthlings"
print(string1[0])   # Prints “G”--NOTE: R indexing starts at 1, but Python starts at 0. 
print(string1[4:9]) # Prints “ting”
print(string1[11:]) # Prints “Earthlings”
print(string1[:5])  # Prints “Greet”

G
tings
Earthlings
Greet

In [66]:
# Prints “Earthlings” again
print(string1[-10:])

Earthlings

In [ ]:
# Prints “Hello world”
print("Hello" + " " + "world")

In [67]:
greetings = ["Hello", "world"]
print(" ".join(greetings))  # Prints "Hello world"

Hello world

In [68]:
# You can also concatenate a combination of strings and variables like in the following example.
name = "Alice"
print("Hello, " + name + "!")  # Prints "Hello, Alice!"

Hello, Alice!

In [69]:
# f-string: My preferred method (f-string: formatted string literals)
name = 'Alice'
print(f"Hello, {name}!")

Hello, Alice!

## If/Else Statements

In [ ]:
# Basic If/else statement for R (Won't run)
a <- 33
b <- 200

if (b > a) {
  print("b is greater than a")
}

In [70]:
a = 33
b = 200
if b > a:
  print("b is greater than a")

b is greater than a

In [71]:
a = 33
b = 33
if b > a:
  print("b is greater than a")
elif a == b:
  print("a and b are equal")

a and b are equal

In [72]:
a = 200
b = 33
if b > a:
  print("b is greater than a")
elif a == b:
  print("a and b are equal")
else:
  print("a is greater than b")

a is greater than b

## While Loops

In [ ]:
# Basic R While Loop
i <- 1
while (i < 6) {
  print(i)
  i <- i + 1
}

In [73]:
# Python
i = 1
while i < 6:
  print(i)
  i += 1

1
2
3
4
5

In [ ]:
# Basic For loop for R
for (x in 1:10) {
  print(x)
}

In [75]:
# Same Code but in Python
for i in range(1, 11):
    print(i)

1
2
3
4
5
6
7
8
9
10

### Branching with While statement and if statement

In [ ]:
i = 1
while i < 6:
  print(i)
  if i == 3:
    break
  i += 1

## Functions

#### Comparison of an older R function I found in GitHub

In [ ]:
find_variable_patterns <- function(variables) {
    result <- data.frame(variable_pattern = character(), long_variable = character(), stringsAsFactors = FALSE)
    for (i in seq_along(variables)) {
        pattern <- variables[i]
        long_vars <- variables[grepl(pattern, variables) & variables != pattern]# Find variables that contain the current variable
        if (length(long_vars) > 0) {# If long variables are found, add them to the result
            for (long_var in long_vars) {
                result <- rbind(result, data.frame(variable_pattern = pattern, long_variable = long_var, stringsAsFactors = FALSE))
            }}} 
    return(result)}

In [ ]:
# Define a simple function called 'greet'
greet <- function(name) {
  message <- paste("Hello,", name, "!")
  return(message)
}

# Call the 'greet' function with an argument
result <- greet("Alice")

In [ ]:
fruits = ["apple", "banana", "cherry"]
for x in fruits:
  print(x)

In [76]:
def my_function(child3, child2, child1):
  return("The youngest child is " + child3)

my_function(child1 = "Emil", child2 = "Tobias", child3 = "Linus")

'The youngest child is Linus'

In [78]:
def my_function(fname, lname):
  print(fname + " " + lname)

my_function("Emil", "Refsnes")

Emil Refsnes

### This line is a snippet of code from a function in GCP

In [ ]:
def should_file_be_exported(file_name):
    '''Check if a file should be exported based on tags to prevent accidental exports.'''
    required_tags = ["_boxfolder_", "_fileid_"]
    forbidden_tags = ["tmp/", "BODY", "HEADER"]
    
    all_required_tags_present = all(tag in file_name for tag in required_tags)
    no_forbidden_tags_present = not any(tag in file_name for tag in forbidden_tags)
    
    # Return TRUE if the file should be exported
    return all_required_tags_present and no_forbidden_tags_present

## Try/Except

In [3]:
x = 10

In [4]:
# Restart Kernel before running 
try:
  print(x)
except:
  print("An exception occurred")

10

In [1]:
# x = 2
y = 5

In [3]:
try:
  print(x)
# except NameError:
#   print("Variable x is not defined")
except Exception as e:
  print(e)
  # print(y)

name 'x' is not defined

In [7]:
x = 10
y = 5
z = 2

In [8]:
try:
  if x == 10:
    print("Hello")
except:
  print("Something went wrong")
  print(y)
else:
  print("Nothing went wrong")
  print(z)

Hello
Nothing went wrong
2

### Pandas

In [5]:
%%python -m pip install pandas

UsageError: %%python is a cell magic, but the cell body is empty.

In [6]:
import pandas as pd
import numpy as np

In [7]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [36]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df = pd.read_csv('file_name.csv')

In [ ]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [14]:
df3 = df2.rename(columns={'A':'test', 'B':'double'})
df3.T

,0,1,2,3
test,1.0,1.0,1.0,1.0
double,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [10]:
df2.head(10)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [ ]:
df2.tail(25)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [41]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [42]:
df2.describe()

         A                    B    C    D
count  4.0                    4  4.0  4.0
mean   1.0  2013-01-02 00:00:00  1.0  3.0
min    1.0  2013-01-02 00:00:00  1.0  3.0
25%    1.0  2013-01-02 00:00:00  1.0  3.0
50%    1.0  2013-01-02 00:00:00  1.0  3.0
75%    1.0  2013-01-02 00:00:00  1.0  3.0
max    1.0  2013-01-02 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0

In [43]:
df2.describe(include='object')

          F
count     4
unique    1
top     foo
freq      4

In [45]:
df2.describe(include='category')

           E
count      4
unique     2
top     test
freq       2

In [51]:
df2.describe(include=['category', 'object'])

           E    F
count      4    4
unique     2    1
top     test  foo
freq       2    4

In [47]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [49]:
df2.describe(exclude=['float32', 'float64', 'int32','datetime64'])

           E    F
count      4    4
unique     2    1
top     test  foo
freq       2    4